Revit 2027 API
BRepBuilder Constructor
 Construct a BRepBuilder to use in constructing geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BRepBuilder(
	BRepType geomType
)
Public Sub New (
	geomType As BRepType
)
public:
BRepBuilder(
	BRepType geomType
)
new :
        geomType : BRepType -> BRepBuilder
Parameters
geomType BRepType
 Specifies the expected type of the output geometry.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace